var data = {
  '我': {
    '爸爸': '爸爸',
    '妈妈': '妈妈',
    '哥哥': '哥哥',
    '弟弟': '弟弟',
    '姐姐': '姐姐',
    '妹妹': '妹妹',
    '丈夫': '丈夫',
    '妻子': '妻子',
    '儿子': '儿子',
    '女儿': '女儿'
  },
  '未知': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '弟弟': '未知',
    '姐姐': '未知',
    '妹妹': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '爸爸': {
    '爸爸': '爷爷',
    '妈妈': '奶奶',
    '哥哥': '伯父',
    '弟弟': '叔叔',
    '姐姐': '姑妈',
    '妹妹': '姑妈',
    '丈夫': '未知',
    '妻子': '妈妈',
    '儿子': {'older': '哥哥', 'middle': '我', 'younger': '弟弟'},
    '女儿': {'older': '姐姐', 'middle': '我', 'younger': '妹妹'}
  },
  '爷爷': {
    '爸爸': '太公',
    '妈妈': '太婆',
    '哥哥': '伯公',
    '弟弟': '叔伯',
    '姐姐': '姑奶奶',
    '妹妹': '姑奶奶',
    '丈夫': '未知',
    '妻子': '奶奶',
    '儿子': {'older': '伯父', 'middle': '爸爸', 'younger': '叔叔'},
    '女儿': '姑妈'
  },
  '奶奶': {
    '爸爸': '外太公',
    '妈妈': '外太婆',
    '哥哥': '舅公',
    '弟弟': '舅公',
    '姐姐': '姨婆',
    '妹妹': '姨婆',
    '丈夫': '爷爷',
    '妻子': '未知',
    '儿子': {'older': '伯父', 'middle': '爸爸', 'younger': '叔叔'},
    '女儿': '姑妈'
  },
  '外公': {
    '爸爸': '外太公',
    '妈妈': '外太婆',
    '哥哥': '外伯公',
    '弟弟': '外伯公',
    '姐姐': '姑姥姥',
    '妹妹': '姑姥姥',
    '丈夫': '未知',
    '妻子': '外婆',
    '儿子': '舅舅',
    '女儿': '姨妈'
  },
  '外婆': {
    '爸爸': '外太公',
    '妈妈': '外太婆',
    '哥哥': '外舅公',
    '弟弟': '外舅公',
    '姐姐': '姑姥姥',
    '妹妹': '姑姥姥',
    '丈夫': '外公',
    '妻子': '未知',
    '儿子': '舅舅',
    '女儿': '姨妈'
  },
  '姑妈': {
    '爸爸': '爷爷',
    '妈妈': '奶奶',
    '哥哥': {'older': '伯父', 'younger': '叔叔', 'middle': '爸爸'},
    '姐姐': '姑妈',
    '丈夫': '姑父',
    '妻子': '未知',
    '弟弟': {'older': '伯父', 'younger': '叔叔', 'middle': '爸爸'},
    '妹妹': '姑妈',
    '儿子': {'older': '表哥', 'younger': '表弟'},
    '女儿': {'older': '表姐', 'younger': '表妹'}
  },
  '姑父': {
    '爸爸': '姑爷爷',
    '妈妈': '姑奶奶',
    '哥哥': '姻世伯',
    '姐姐': '姻伯母',
    '丈夫': '未知',
    '妻子': '姑妈',
    '弟弟': '姻世伯',
    '妹妹': '姻伯母',
    '儿子': {'older': '表哥', 'younger': '表弟'},
    '女儿': {'older': '表姐', 'younger': '表妹'}
  },
  '伯父': {
    '爸爸': '爷爷',
    '妈妈': '奶奶',
    '哥哥': '伯父',
    '姐姐': '姑妈',
    '丈夫': '未知',
    '妻子': '伯母',
    '弟弟': {'older': '伯父', 'younger': '叔叔', 'middle': '爸爸'},
    '妹妹': '姑妈',
    '儿子': {'older': '堂哥', 'younger': '堂弟'},
    '女儿': {'older': '堂姐', 'younger': '堂妹'}
  },
  '伯母': {
    '爸爸': '姻伯公',
    '妈妈': '姻伯婆',
    '哥哥': '姻世伯',
    '姐姐': '姻伯母',
    '丈夫': '伯父',
    '妻子': '未知',
    '弟弟': '姻世伯',
    '妹妹': '姻伯母',
    '儿子': {'older': '堂哥', 'younger': '堂弟'},
    '女儿': {'older': '堂姐', 'younger': '堂妹'}
  },
  '叔叔': {
    '爸爸': '爷爷',
    '妈妈': '奶奶',
    '哥哥': {'older': '伯父', 'younger': '叔叔', 'middle': '爸爸'},
    '姐姐': '姑妈',
    '丈夫': '未知',
    '妻子': '婶婶',
    '弟弟': '叔叔',
    '妹妹': '姑妈',
    '儿子': {'older': '堂哥', 'younger': '堂弟'},
    '女儿': {'older': '堂姐', 'younger': '堂妹'}
  },
  '婶婶': {
    '爸爸': '姻伯公',
    '妈妈': '姻伯婆',
    '哥哥': '姻世伯',
    '姐姐': '姻伯母',
    '丈夫': '叔叔',
    '妻子': '未知',
    '弟弟': '姻世伯',
    '妹妹': '姻伯母',
    '儿子': {'older': '堂哥', 'younger': '堂弟'},
    '女儿': {'older': '堂姐', 'younger': '堂妹'}
  },
  '妈妈': {
    '爸爸': '外公',
    '妈妈': '外婆',
    '哥哥': '舅舅',
    '姐姐': '姨妈',
    '丈夫': '爸爸',
    '妻子': '未知',
    '弟弟': '舅舅',
    '妹妹': '姨妈',
    '儿子': {'older': '哥哥', 'younger': '弟弟', 'middle': '我'},
    '女儿': {'older': '姐姐', 'younger': '妹妹', 'middle': '我'}
  },
  '舅舅': {
    '爸爸': '外公',
    '妈妈': '外婆',
    '哥哥': '舅舅',
    '姐姐': {'older': '姨妈', 'younger': '妈妈'},
    '丈夫': '未知',
    '妻子': '舅妈',
    '弟弟': '舅舅',
    '妹妹': {'older': '姨妈', 'younger': '妈妈'},
    '儿子': {'older': '表哥', 'younger': '表弟'},
    '女儿': {'older': '表姐', 'younger': '表妹'}
  },
  '舅妈': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '舅舅',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': {'older': '表哥', 'younger': '表弟'},
    '女儿': {'older': '表姐', 'younger': '表妹'}
  },
  '姨妈': {
    '爸爸': '外公',
    '妈妈': '外婆',
    '哥哥': '舅舅',
    '姐姐': {'older': '姨妈', 'younger': '妈妈'},
    '丈夫': '姨夫',
    '妻子': '未知',
    '弟弟': '舅舅',
    '妹妹': {'older': '姨妈', 'younger': '妈妈'},
    '儿子': {'older': '表哥', 'younger': '表弟'},
    '女儿': {'older': '表姐', 'younger': '表妹'}
  },
  '姨夫': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '姨妈',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': {'older': '表哥', 'younger': '表弟'},
    '女儿': {'older': '表姐', 'younger': '表妹'}
  },
  '哥哥': {
    '爸爸': '爸爸',
    '妈妈': '妈妈',
    '哥哥': '哥哥',
    '姐姐': '姐姐',
    '丈夫': '未知',
    '妻子': '嫂嫂',
    '弟弟': {'older': '哥哥', 'younger': '弟弟', 'middle': '我'},
    '妹妹': {'older': '姐姐', 'younger': '妹妹', 'middle': '我'},
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '嫂嫂': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '哥哥',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '弟弟': {
    '爸爸': '爸爸',
    '妈妈': '妈妈',
    '哥哥': {'older': '哥哥', 'younger': '弟弟', 'middle': '我'},
    '姐姐': {'older': '姐姐', 'younger': '妹妹', 'middle': '我'},
    '丈夫': '未知',
    '妻子': '弟媳',
    '弟弟': '弟弟',
    '妹妹': '妹妹',
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '弟媳': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '弟弟',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '姐夫': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '姐姐',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '姐姐': {
    '爸爸': '爸爸',
    '妈妈': '妈妈',
    '哥哥': '哥哥',
    '姐姐': '姐姐',
    '丈夫': '姐夫',
    '妻子': '未知',
    '弟弟': {'older': '哥哥', 'younger': '弟弟', 'middle': '我'},
    '妹妹': {'older': '姐姐', 'younger': '妹妹', 'middle': '我'},
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '妹妹': {
    '爸爸': '爸爸',
    '妈妈': '妈妈',
    '哥哥': {'older': '哥哥', 'younger': '弟弟', 'middle': '我'},
    '姐姐': {'older': '姐姐', 'younger': '妹妹', 'middle': '我'},
    '丈夫': '妹夫',
    '妻子': '未知',
    '弟弟': '弟弟',
    '妹妹': '妹妹',
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '妹夫': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '妹妹',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '儿子': {
    '爸爸': {'older': '丈夫', 'middle': '我'},
    '妈妈': {'older': '妻子', 'middle': '我'},
    '哥哥': '儿子',
    '姐姐': '女儿',
    '丈夫': '未知',
    '妻子': '媳妇',
    '弟弟': '儿子',
    '妹妹': '女儿',
    '儿子': '孙子',
    '女儿': '孙女'
  },
  '媳妇': {
    '爸爸': '亲家公',
    '妈妈': '亲家母',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '儿子',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '孙子',
    '女儿': '孙女'
  },
  '女儿': {
    '爸爸': {'older': '丈夫', 'middle': '我'},
    '妈妈': {'older': '妻子', 'middle': '我'},
    '哥哥': '儿子',
    '姐姐': '女儿',
    '丈夫': '女婿',
    '妻子': '未知',
    '弟弟': '儿子',
    '妹妹': '女儿',
    '儿子': '外孙',
    '女儿': '外孙女'
  },
  '女婿': {
    '爸爸': '亲家公',
    '妈妈': '亲家母',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '女儿',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '外孙',
    '女儿': '外孙女'
  },
  '丈夫': {
    '爸爸': '公公',
    '妈妈': '婆婆',
    '哥哥': '大伯子',
    '姐姐': '大姑子',
    '丈夫': '未知',
    '妻子': '我',
    '弟弟': '小叔子',
    '妹妹': '小姑子',
    '儿子': '儿子',
    '女儿': '女儿'
  },
  '妻子': {
    '爸爸': '丈人',
    '妈妈': '丈母娘',
    '哥哥': '大舅子',
    '姐姐': '大姨子',
    '丈夫': '我',
    '妻子': '未知',
    '弟弟': '小舅子',
    '妹妹': '小姨子',
    '儿子': '儿子',
    '女儿': '女儿'
  },
  '大伯子': {
    '爸爸': '公公',
    '妈妈': '婆婆',
    '哥哥': '大伯子',
    '姐姐': '大姑子',
    '丈夫': '未知',
    '妻子': '嫂嫂',
    '弟弟': {'older': '大伯子', 'younger': '小叔子', 'middle': '丈夫'},
    '妹妹': {'older': '大姑子', 'younger': '小姑子', 'middle': '丈夫'},
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '小叔子': {
    '爸爸': '公公',
    '妈妈': '婆婆',
    '哥哥': {'older': '大伯子', 'younger': '小叔子', 'middle': '丈夫'},
    '姐姐': {'older': '大姑子', 'younger': '小姑子', 'middle': '丈夫'},
    '丈夫': '未知',
    '妻子': '弟妹',
    '弟弟': '小叔子',
    '妹妹': '小姑子',
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '大姑子': {
    '爸爸': '公公',
    '妈妈': '婆婆',
    '哥哥': '大伯子',
    '姐姐': '大姑子',
    '丈夫': '姑丈',
    '妻子': '未知',
    '弟弟': {'older': '大伯子', 'younger': '小叔子', 'middle': '丈夫'},
    '妹妹': {'older': '大姑子', 'younger': '小姑子', 'middle': '丈夫'},
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '小姑子': {
    '爸爸': '公公',
    '妈妈': '婆婆',
    '哥哥': {'older': '大伯子', 'younger': '小叔子', 'middle': '丈夫'},
    '姐姐': {'older': '大姑子', 'younger': '小姑子', 'middle': '丈夫'},
    '丈夫': '姑丈',
    '妻子': '未知',
    '弟弟': '小叔子',
    '妹妹': '小姑子',
    '儿子': '侄子',
    '女儿': '侄女'
  },
  '大舅子': {
    '爸爸': '丈人',
    '妈妈': '丈母娘',
    '哥哥': '大舅子',
    '姐姐': '大姨子',
    '丈夫': '未知',
    '妻子': '大妗子',
    '弟弟': {'older': '大舅子', 'younger': '小舅子', 'middle': '妻子'},
    '妹妹': {'older': '大姨子', 'younger': '小姨子', 'middle': '妻子'},
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '小舅子': {
    '爸爸': '丈人',
    '妈妈': '丈母娘',
    '哥哥': {'older': '大舅子', 'younger': '小舅子', 'middle': '妻子'},
    '姐姐': {'older': '大姨子', 'younger': '小姨子', 'middle': '妻子'},
    '丈夫': '未知',
    '妻子': '小妗子',
    '弟弟': '小舅子',
    '妹妹': '小姨子',
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '大姨子': {
    '爸爸': '丈人',
    '妈妈': '丈母娘',
    '哥哥': '大舅子',
    '姐姐': '大姨子',
    '丈夫': '姐夫',
    '妻子': '未知',
    '弟弟': {'older': '大舅子', 'younger': '小舅子', 'middle': '妻子'},
    '妹妹': {'older': '大姨子', 'younger': '小姨子', 'middle': '妻子'},
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '小姨子': {
    '爸爸': '丈人',
    '妈妈': '丈母娘',
    '哥哥': {'older': '大舅子', 'younger': '小舅子', 'middle': '妻子'},
    '姐姐': {'older': '大姨子', '妹妹': '小姨子', 'middle': '妻子'},
    '丈夫': '妹夫',
    '妻子': '未知',
    '弟弟': '小舅子',
    '妹妹': '小姨子',
    '儿子': '外甥',
    '女儿': '外甥女'
  },
  '太公': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '太婆': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外太公': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外太婆': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '孙子': {
    '爸爸': '儿子',
    '妈妈': '女儿',
    '哥哥': '孙子',
    '姐姐': '孙女',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '孙子',
    '妹妹': '孙女',
    '儿子': '未知',
    '女儿': '未知'
  },
  '孙女': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '孙子',
    '姐姐': '孙女',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '孙子',
    '妹妹': '孙女',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外孙': {
    '爸爸': '女婿',
    '妈妈': '女儿',
    '哥哥': '外孙',
    '姐姐': '外孙女',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '外孙',
    '妹妹': '外孙女',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外孙女': {
    '爸爸': '女婿',
    '妈妈': '女儿',
    '哥哥': '外孙',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '外孙',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '弟妹': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '大妗子': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '小妗子': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '姑姥姥': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '姑奶奶': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '姻世伯': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '姻世母': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '姻伯公': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '姑姥婆': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外伯公': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '侄子': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '侄女': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外甥': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  },
  '外甥女': {
    '爸爸': '未知',
    '妈妈': '未知',
    '哥哥': '未知',
    '姐姐': '未知',
    '丈夫': '未知',
    '妻子': '未知',
    '弟弟': '未知',
    '妹妹': '未知',
    '儿子': '未知',
    '女儿': '未知'
  }
};

var elem_names = document.getElementsByClassName('name');
var elem_dels = document.getElementsByClassName('del');
var elem_equal = document.getElementById('equal');

var elem_input1 = document.getElementById("input1");
var elem_input2 = document.getElementById("input2");

var elem_record = document.getElementsByClassName("record");

var is_load = false;


for (let i = 0; i < elem_names.length; i++) {
	elem_names[i].addEventListener('click', input_name);
}
for (let i = 0; i < elem_record.length; i++) {
    elem_record[i].addEventListener('click', function () { load(i); });
}

elem_equal.addEventListener('click', answer);
elem_dels[0].addEventListener('click', OneDelete);
elem_dels[1].addEventListener('click', Reset);

function input_name() {
	if(is_load){
		return;
	}
	if(elem_input2.innerText.length == 0){
		elem_input2.innerText += get_real_name(this.innerText);
	}
	else{
		elem_input2.innerText += '的' + get_real_name(this.innerText);
	}
}

function get_real_name(arr) {
	if (arr == '父') {
		return '爸爸';
	}
	else if (arr == '母') {
		return '妈妈';
	}
	else if (arr == '兄') {
		return '哥哥';
	}
	else if (arr == '弟') {
		return '弟弟';
	}
	else if (arr == '姐') {
		return '姐姐';
	}
	else if (arr == '妹') {
		return '妹妹';
	}
	else if (arr == '夫') {
		return '丈夫';
	}
	else if (arr == '妻') {
		return '妻子';
	}
	else if (arr == '子') {
		return '儿子';
	}
	else if (arr == '女') {
		return '女儿';
	}
}

function Reset() {
	elem_input1.innerText = '';
	elem_input2.innerText = '';
	is_load = false;
}

function OneDelete() {
	if (!is_load) {
		if (elem_input2.innerText.length > 2) {
			elem_input2.innerText = elem_input2.innerText.slice(0, elem_input2.innerText.length - 3);
		}
		else {
			elem_input2.innerText = '';
		}
	}
}

function answer() {
	if(is_load){
		return;
	}
	is_load = true;
	if (elem_input2.innerText.length > 0) {
		elem_input1.innerText = elem_input2.innerText;
		elem_input2.innerText = '';
		get_result();
		my_shift();
		elem_record[0].innerHTML = elem_input1.innerHTML;
		for (let i = 0; i < 10; i++) {
			var name = "family_record" + i;
			localStorage.setItem(name, elem_record[i].innerHTML);
		}
	}
}

function get_result() {
	var result = [];
	var arr = elem_input1.innerText.split('的');

	function get_leaf_data(str, t_arr) {
		if(!str){
			return;
		}
		if (typeof t_arr != 'object' || t_arr.length == 0) {
			result.push(str);
			return;
		}
		var data_elem = data[str];
		for (let i = 0; i < t_arr.length; i++) {
			if (typeof data_elem[t_arr[i]] == 'object') {
				for (let j in data_elem[t_arr[i]]) {
					get_leaf_data(data_elem[t_arr[i]][j], t_arr.slice(i + 1, t_arr.length));
				}
				return;
			}

			if (i == t_arr.length - 1 && typeof data_elem[t_arr[i]] == 'string') {
				result.push(data_elem[t_arr[i]]);
				return;
			}
			data_elem = data[data_elem[t_arr[i]]];
		}
		result.push('未知');
	}

	get_leaf_data('我', arr);
	result = unique(result);
	for(let i = 0; i < result.length; i++){
		elem_input2.innerText += result[i];
		if(i != result.length - 1){
			elem_input2.innerText += ',';
		}
	}
}

function unique(arr) {
	var tmp = new Array();
	var tmparr = new Array();
	for(var m in arr){
		tmp[arr[m]]=1;
	}
	for(var n in tmp){
		tmparr.push(n);
	}
	return tmparr;
}

function my_shift() {
    var arr = [];
    for (var i = 0; i < 6; i++) {
        arr.push(elem_record[i].innerHTML);
    }
    for (var i = 1; i < 7; i++) {
        elem_record[i].innerHTML = arr[i - 1];
    }
}

function load(num) {
    if (elem_record[num].innerHTML != "") {
		elem_input1.innerHTML = elem_record[num].innerHTML;
		elem_input2.innerText = '';
		get_result();
		is_load = true;
	}
}

function load_record() {
    for (var i = 0; i < 7; i++) {
        var name = "family_record" + i;
        elem_record[i].innerHTML = localStorage.getItem(name);
    }
}

function change_calculator(selector) {
    document.location = selector.value + '.html';
}
